# Movie Success
- Andrea Cohen
- 03.16.23

## Business Problem:
- to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset
- to use this database to analyze what makes a movie successful
- to provide recommendations to the stakeholder on how to make a successful movie

## Tasks:
1.  Download several files from IMDB’s movie data set and filter out the subset of moves requested by the stakeholder.
2.  Use an API to extract box office revenue and profit data to add to the IMDB data and perform exploratory data analysis.
3.  Construct and export a MySQL database using the data.
4.  Apply hypothesis testing to explore what makes a movie successful.
5.  Produce a Linear Regression model to predict movie performance.

## Prediction Tasks:
- use hypothesis testing and statistics knowledge to answer 3 questions about what makes a successful movie in the age of streaming (post-2013):
    - Does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?
    - Does the genre of a movie affect how much revenue the movie generates?
    - Does the budget of a movie affect how much revenue the movie generates?

## Data:

Data Location - The dataset files can be accessed and downloaded from https://datasets.imdbws.com/. The data is refreshed daily.

Data Source - TMDB

![png](TMDB1024_1.png)

IMDb Dataset Details -

- title.akas.tsv.gz -  
Contains the following information for titles:

 - titleId (string) - a tconst, an alphanumeric unique identifier of the title
 - ordering (integer) – a number to uniquely identify rows for a given titleId
 - title (string) – the localized title
 - region (string) - the region for this version of the title
 - language (string) - the language of the title
 - types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
 - attributes (array) - Additional terms to describe this alternative title, not enumerated
 - isOriginalTitle (boolean) – 0: not original title; 1: original title  
 
 
- title.basics.tsv.gz -   
Contains the following information for titles:
 - tconst (string) - alphanumeric unique identifier of the title
 - titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
 - primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
 - originalTitle (string) - original title, in the original language
 - isAdult (boolean) - 0: non-adult title; 1: adult title
 - startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
 - endYear (YYYY) – TV Series end year. ‘\N’ for all other title types
 - runtimeMinutes – primary runtime of the title, in minutes
 - genres (string array) – includes up to three genres associated with the title  
 
- title.ratings.tsv.gz –   
Contains the IMDb rating and votes information for titles
 - tconst (string) - alphanumeric unique identifier of the title
 - averageRating – weighted average of all the individual user ratings
 - numVotes - number of votes the title has received

## Preliminary Steps

### Import libraries

In [15]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json, os, time
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.engine import create_engine
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *
import scipy.stats as stats
from statsmodels.stats.multicomp import pairwise_tukeyhsd
import glob

### Extract financial data for the target years (2013 - 2022)

#### Credentials and Accessing the API

In [3]:
with open('/Users/andreacohen/.secret/tmdb_api.json', 'r') as f:
    login = json.load(f)
tmdb.API_KEY = login['api-key']

#### Custom functions

In [5]:
# add the certification (MPGG Rating) to movie.info
def get_movie_with_rating(movie_id):
    """Adapted from source = https://github.com/celiao/tmdbsimple"""
    #get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    #save the .info, .releases dictionaries
    info = movie.info()
    releases = movie.releases()
    #loop through countries in releases
    for c in releases['countries']:
        #if the country abbreviation == US
        if c['iso_3166_1'] == 'US':
            #save a certification key in info with the certification
            info['certification'] = c['certification']
    return info

In [6]:
# append/extend a JSON file with Python
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    with open(filename,'r+') as file:
        # First load existing data into a dict
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Set file's current position as offset
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

#### Designate a folder to save the information

In [7]:
FOLDER = "Data2/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['tmdb_api_results_2000.json',
 'final_tmdb_data_2000.csv.gz',
 'tmdb_api_results_2001.json',
 'title_basics.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 '.ipynb_checkpoints',
 'title_akas.csv.gz',
 'tmdb_results_combined.csv.gz',
 'title_ratings.csv.gz']

#### Load in the Title Basics data

In [8]:
# Load in the dataframe from project part 1 as basics:
basics = pd.read_csv('Data/title_basics.csv.gz')

#### Define the years to retrieve

In [9]:
YEARS_TO_GET = [2013,2014,2015,2016,2017,2018,2019,2020,2021,2022]

#### Define an errors list

In [10]:
errors = [ ]

#### Create a nested loop
Outer loop organizes output by year into separate .json files  
Inner loop makes API calls based on the existing IMDB IDs

In [11]:
# set up progress bar
for YEAR in tqdm_notebook(YEARS_TO_GET, desc='YEARS', position=0):
    # define a JSON_FILE to save the results in progress
    JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'
    # check if file exists
    file_exists = os.path.isfile(JSON_FILE)
    # if it does not exist: create it
    if file_exists == False:
        # save an empty dict with just "imdb_id" to the new json file.
        with open(JSON_FILE,'w') as f:
            json.dump([{'imdb_id':0}],f)
    # define/filter the IDs to call
    # save new year as the current df
    df = basics.loc[basics['startYear']==YEAR].copy()
    # save movie ids to list
    movie_ids = df['tconst'].copy()
    # load existing data from json into a dataframe called "previous_df"
    previous_df = pd.read_json(JSON_FILE)
    # filter out any ids that are already in the JSON_FILE
    movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]
    # iterate through the list of Movie IDs and make the calls
    for movie_id in tqdm_notebook(movie_ids_to_get,
                                  desc=f'Movies from {YEAR}',
                                  position=1,
                                  leave=True):
        try:
            # retrieve the data for the movie id
            temp = get_movie_with_rating(movie_id)  
            # append/extend results to existing file using a pre-made function
            write_json(temp,JSON_FILE)
            # short 20 ms sleep to prevent overwhelming server
            time.sleep(0.02)
        except Exception as e:
            errors.append([movie_id, e])
    # save the year's results as csv.gz file
    final_year_df = pd.read_json(JSON_FILE)
    final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression="gzip", index=False)

YEARS:   0%|          | 0/10 [00:00<?, ?it/s]

Movies from 2013:   0%|          | 0/4679 [00:00<?, ?it/s]

Movies from 2014:   0%|          | 0/4884 [00:00<?, ?it/s]

Movies from 2015:   0%|          | 0/5016 [00:00<?, ?it/s]

Movies from 2016:   0%|          | 0/5219 [00:00<?, ?it/s]

Movies from 2017:   0%|          | 0/5592 [00:00<?, ?it/s]

Movies from 2018:   0%|          | 0/5715 [00:00<?, ?it/s]

Movies from 2019:   0%|          | 0/5825 [00:00<?, ?it/s]

Movies from 2020:   0%|          | 0/4940 [00:00<?, ?it/s]

Movies from 2021:   0%|          | 0/5036 [00:00<?, ?it/s]

Movies from 2022:   0%|          | 0/4601 [00:00<?, ?it/s]

#### Concatenate the data into 1 dataframe

In [38]:
q = "Data2/final_tmdb_data*.csv.gz"
files = sorted(glob.glob(q))
files

['Data2/final_tmdb_data_2013.csv.gz',
 'Data2/final_tmdb_data_2014.csv.gz',
 'Data2/final_tmdb_data_2015.csv.gz',
 'Data2/final_tmdb_data_2016.csv.gz',
 'Data2/final_tmdb_data_2017.csv.gz',
 'Data2/final_tmdb_data_2018.csv.gz',
 'Data2/final_tmdb_data_2019.csv.gz',
 'Data2/final_tmdb_data_2020.csv.gz',
 'Data2/final_tmdb_data_2021.csv.gz',
 'Data2/final_tmdb_data_2022.csv.gz']

In [53]:
movies_2013_2022_list = []
for file in files:
    temp_df = pd.read_csv(file, lineterminator='\n')
    movies_2013_2022_list.append(temp_df)
movies_2013_2022 = pd.concat(movies_2013_2022_list)
movies_2013_2022

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0255820,0.0,NaN,NaN,2000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,323498.0,en,Return to Babylon,...,0.0,75.0,[],Released,NaN,Return to Babylon,0.0,5.826,22.0,NaN
2,tt0359950,0.0,/p23Zvxx6vrVpo4G2ZCxi1DTLm5r.jpg,NaN,90000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 35, '...",https://www.20thcenturystudios.com/movies/the-...,116745.0,en,The Secret Life of Walter Mitty,...,188133322.0,114.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"Stop Dreaming, Start Living",The Secret Life of Walter Mitty,0.0,7.163,6854.0,PG
3,tt0409379,0.0,/3tjCnZ9GFLiuMjAHxXAm5Tc98W2.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",http://insecretmovie.com/,172226.0,en,In Secret,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,In Secret,0.0,6.250,184.0,R
4,tt0452183,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}]",NaN,439174.0,en,Blunt Movie,...,0.0,83.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,From the creators of ABSOLUTELY NOTHING before...,Blunt Movie,0.0,3.700,3.0,R
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3387,tt9883664,0.0,NaN,NaN,0.0,[],NaN,1031225.0,en,Equally Friends,...,0.0,47.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Equally Friends,0.0,0.000,0.0,NaN
3388,tt9893130,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}, {'id': 28, 'nam...",NaN,972731.0,en,"2025: Blood, White & Blue",...,0.0,135.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,THE PURGE meets US,"2025: Blood, White & Blue",0.0,4.000,1.0,NaN
3389,tt9893158,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 10749, 'n...",NaN,796955.0,en,Clowning,...,0.0,96.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Warm nights... Feels like death in the sand du...,Clowning,0.0,8.000,1.0,NaN
3390,tt9893160,0.0,/jX5XGqJUTzvpta2RjcX6pMZqxk5.jpg,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 80, 'n...",NaN,606303.0,en,No Way Out,...,0.0,89.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Find what you love and let it kill you.,No Way Out,0.0,4.900,9.0,NaN
3391,tt9904648,0.0,/ibWj2ARVrAabIWDq5vSXoJRZfVV.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",https://contrastmovie.com/,933557.0,en,The Contrast,...,0.0,82.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everybody loves... somebody else.,The Contrast,0.0,3.000,1.0,NaN

#### Filter the movies with at least some valid financial information

In [54]:
budget_filter = movies_2013_2022['budget'] > 0
revenue_filter = movies_2013_2022['revenue'] > 0
financial_2013_2022 = movies_2013_2022[budget_filter | revenue_filter]

#### Final merged .csv.gz of all of the tmdb api data

In [55]:
financial_2013_2022.to_csv("Data2/tmdb_results_combined2.csv.gz",compression='gzip',index=False)

### Transform the data to prepare for a relational database

#### basics

Include only movies that were released between 2013 and 2022

In [56]:
startyearfilter1 = basics['startYear']>=2013
startyearfilter2 = basics['startYear']<=2022
basics = basics[startyearfilter1 & startyearfilter2]

In [44]:
display(basics.head())
display(basics.info())

,tconst,primaryTitle,startYear,runtimeMinutes
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
5,tt0100275,The Wandering Soap Opera,2017.0,80
28,tt0119830,One Dog Day,2022.0,101
36,tt0120589,A Dangerous Practice,2022.0,108

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51507 entries, 1 to 85624
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          51507 non-null  object
 1   primaryTitle    51507 non-null  object
 2   startYear       51507 non-null  float64
 3   runtimeMinutes  51507 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.0+ MB

None

#### title_genres

In [57]:
display(title_genres.head())
display(title_genres.info())

      tconst  genre_id
1  tt0062336         7
2  tt0069049         7
5  tt0100275         5
5  tt0100275         7
5  tt0100275         9

<class 'pandas.core.frame.DataFrame'>
Int64Index: 95856 entries, 1 to 85624
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   tconst    95856 non-null  object
 1   genre_id  95856 non-null  int64
dtypes: int64(1), object(1)
memory usage: 2.2+ MB

None

#### genres

In [46]:
display(genres.head())
display(genres.info())

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

None

#### TMDB

In [60]:
tmdb_df = pd.read_csv('Data2/tmdb_results_combined2.csv.gz', lineterminator='\n')
display(tmdb_df.head())
display(tmdb_df.info())

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0255820,0.0,NaN,NaN,2000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,323498.0,en,Return to Babylon,...,0.0,75.0,[],Released,NaN,Return to Babylon,0.0,5.826,22.0,NaN
1,tt0359950,0.0,/p23Zvxx6vrVpo4G2ZCxi1DTLm5r.jpg,NaN,90000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 35, '...",https://www.20thcenturystudios.com/movies/the-...,116745.0,en,The Secret Life of Walter Mitty,...,188133322.0,114.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"Stop Dreaming, Start Living",The Secret Life of Walter Mitty,0.0,7.163,6854.0,PG
2,tt0453562,0.0,/eyjWwMOgkq4nh0wMtyW8XPJ749H.jpg,NaN,40000000.0,"[{'id': 18, 'name': 'Drama'}]",NaN,109410.0,en,42,...,95020213.0,128.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The True Story of an American Legend,42,0.0,7.145,1581.0,PG-13
3,tt0463960,0.0,NaN,NaN,2000000.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 53, '...",NaN,206349.0,en,The Devil You Know,...,0.0,72.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Every Family Has Its Secrets.,The Devil You Know,0.0,4.500,22.0,NR
4,tt0469021,0.0,/jZbenMUxHMCMAssc0VPP1Dw5Mdt.jpg,NaN,4000000.0,"[{'id': 35, 'name': 'Comedy'}]",http://alanpartridge-alphapapa.com,177699.0,en,Alan Partridge: Alpha Papa,...,9800000.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,12 hostages. 24 hours. 1 Partridge.,Alan Partridge: Alpha Papa,0.0,6.700,383.0,PG-13

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7738 entries, 0 to 7737
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                7738 non-null   object
 1   adult                  7738 non-null   float64
 2   backdrop_path          6211 non-null   object
 3   belongs_to_collection  921 non-null    object
 4   budget                 7738 non-null   float64
 5   genres                 7738 non-null   object
 6   homepage               3217 non-null   object
 7   id                     7738 non-null   float64
 8   original_language      7738 non-null   object
 9   original_title         7738 non-null   object
 10  overview               7676 non-null   object
 11  popularity             7738 non-null   float64
 12  poster_path            7514 non-null   object
 13  production_companies   7738 non-null   object
 14  production_countries   7738 non-null   object
 15  release_date           7607 non-null   object
 16  revenue                7738 non-null   float64
 17  runtime                7738 non-null   float64
 18  spoken_languages       7738 non-null   object
 19  status                 7738 non-null   object
 20  tagline                4550 non-null   object
 21  title                  7738 non-null   object
 22  video                  7738 non-null   float64
 23  vote_average           7738 non-null   float64
 24  vote_count             7738 non-null   float64
 25  certification          3422 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.5+ MB

None

Discard unnecessary information

In [61]:
tmdb_df = tmdb_df[['imdb_id', 'revenue', 'budget', 'certification']]
display(tmdb_df.head())
display(tmdb_df.info())

     imdb_id      revenue      budget certification
0  tt0255820          0.0   2000000.0           NaN
1  tt0359950  188133322.0  90000000.0            PG
2  tt0453562   95020213.0  40000000.0         PG-13
3  tt0463960          0.0   2000000.0            NR
4  tt0469021    9800000.0   4000000.0         PG-13

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7738 entries, 0 to 7737
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        7738 non-null   object
 1   revenue        7738 non-null   float64
 2   budget         7738 non-null   float64
 3   certification  3422 non-null   object
dtypes: float64(2), object(2)
memory usage: 241.9+ KB

None

#### Ratings

In [62]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')

Include only movies that were released between 2013 and 2022

In [64]:
keepers = ratings['tconst'].isin(basics['tconst'])
ratings = ratings[keepers]
display(ratings.head())
display(ratings.info())

          tconst  averageRating  numVotes
30412  tt0062336            6.4       167
34196  tt0069049            6.7      7576
50970  tt0100275            6.5       342
61137  tt0119830            7.2        28
61572  tt0120589            7.1       157

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41747 entries, 30412 to 490251
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         41747 non-null  object
 1   averageRating  41747 non-null  float64
 2   numVotes       41747 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ MB

None

In [ ]:
display(basics.head())
display(ratings.head())
display(title_genres.head())
display(genres.head())
display(tmdb_df.head())

### Database

In [ ]:
with open('/Users/andreacohen/.secret/mysql.json','r') as f:
    login = json.load(f) 
login.keys()

In [ ]:
#create connection string
connection_str = f"mysql+pymysql://{login['username']}:{quote_plus(login['password'])}@localHost/movies2"

In [ ]:
# create the engine
engine = create_engine(connection_str)

In [ ]:
# create a new database
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

In [ ]:
# verify that the database was created
database_exists(connection_str)

#### title_basics

Create a datatype schema for to_sql

In [ ]:
# Check the dtypes of the dataframe
basics.dtypes

In [ ]:
# Get the maximum string length for any text column
max_str_len_basics_tconst = basics['tconst'].fillna('').map(len).max()
max_str_len_title = basics['primaryTitle'].fillna('').map(len).max()

In [ ]:
# Create a dictionary with each column name as a key and the corresponding SQL datatype as the value
basics_sql_datatype = {'tconst': String(max_str_len_basics_tconst+1),
                      'primaryTitle': Text(max_str_len_title+1),
                      'startYear': Float(),
                      'runtimeMinutes': Integer()}

Add table to the database

In [ ]:
basics.to_sql('title_basics', engine, dtype = basics_sql_datatype, if_exists = 'replace', index = False)

Set the desired column as the primary key

In [ ]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (tconst);')

Show the first 5 rows of the table using a SQL query

In [ ]:
query = """
SELECT *
FROM title_basics
LIMIT 5;
"""
pd.read_sql(query, engine)

#### title_ratings

Create a datatype schema for to_sql

In [ ]:
# Check the dtypes of the dataframe
ratings.dtypes

In [ ]:
# Get the maximum string length for any text column
max_str_len_ratings_tconst = ratings['tconst'].fillna('').map(len).max()

In [ ]:
# Create a dictionary with each column name as a key and the corresponding SQL datatype as the value
ratings_sql_datatype = {'tconst': String(max_str_len_ratings_tconst+1),
                        'averageRating': Float(),
                        'numVotes': Integer()}

Add table to the database

In [ ]:
ratings.to_sql('title_ratings', engine, dtype = ratings_sql_datatype, if_exists = 'replace', index = False)

Set the desired column as the primary key

In [ ]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (tconst);')

Show the first 5 rows of the table using a SQL query

In [ ]:
query = """
SELECT *
FROM title_ratings
LIMIT 5;
"""
pd.read_sql(query, engine)

#### title_genres

Create a datatype schema for to_sq

In [ ]:
# Check the dtypes of the dataframe
title_genres.dtypes

In [ ]:
# Get the maximum string length for any text column
max_str_len_title_genres_tconst = title_genres['tconst'].fillna('').map(len).max()

In [ ]:
# Create a dictionary with each column name as a key and the corresponding SQL datatype as the value
title_genres_sql_datatype = {'tconst': String(max_str_len_title_genres_tconst+1),
                             'genre_id': Integer()}

Add table to the database

In [ ]:
title_genres.to_sql('title_genres', engine, dtype = title_genres_sql_datatype, if_exists = 'replace', index = False)

Show the first 5 rows of the table using a SQL query

In [ ]:
query = """
SELECT *
FROM title_genres
LIMIT 5;
"""
pd.read_sql(query, engine)

#### genres

Create a datatype schema for to_sql

In [ ]:
# Check the dtypes of the dataframe
genres.dtypes

In [ ]:
# Get the maximum string length for any text column
max_str_len_genre_name = genres['genre_name'].fillna('').map(len).max()

In [ ]:
# Create a dictionary with each column name as a key and the corresponding SQL datatype as the value
genre_sql_datatype = {'genre_name': Text(max_str_len_genre_name+1),
                      'genre_id': Integer()}

Add table to the database

In [ ]:
genres.to_sql('genres', engine, dtype = genre_sql_datatype, if_exists = 'replace', index = False)

Set the desired column as the primary key

In [ ]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (genre_id);')

Show the first 5 rows of the table using a SQL query

In [ ]:
query = """
SELECT *
FROM genres
LIMIT 5;
"""
pd.read_sql(query, engine)

#### tmdb_data

Create a datatype schema for to_sql

In [ ]:
# Check the dtypes of the dataframe
tmdb_df.dtypes

In [ ]:
# Get the maximum string length for any text column
max_str_len_imdb_id = tmdb_df['imdb_id'].fillna('').map(len).max()
max_str_len_certification = tmdb_df['certification'].fillna('').map(len).max()

In [ ]:
# Create a dictionary with each column name as a key and the corresponding SQL datatype as the value
tmdb_sql_datatype = {'imdb_id': String(max_str_len_imdb_id+1),
                     'revenue': Float(),
                     'budget': Float(),
                     'certification': Text(max_str_len_certification+1)}

Add table to the database

In [ ]:
tmdb_df.to_sql('tmdb_data', engine, dtype = tmdb_sql_datatype, if_exists = 'replace', index = False)

Set the desired column as the primary key

In [ ]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (imdb_id);')

In [ ]:
Show the first 5 rows of the table using a SQL query

In [ ]:
query = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(query, engine)

In [ ]:
# test the database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

## Does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?

### Separate the data into groups

In [ ]:
# create a database with the target columns
query = """
select revenue, certification
from tmdb_data;
"""
x = pd.read_sql(query, engine)
df_hypothesis1 = pd.DataFrame(x, columns = ['revenue', 'certification'])
df_hypothesis1.head()

In [ ]:
# separate the groups
groups = {}
for i in df_hypothesis1['certification'].unique():
    data = df_hypothesis1.loc[df_hypothesis1['certification']==i,'revenue'].copy()
    groups[i] = data
groups.keys()

### State the Null Hypothesis and Alternative Hypothesis
- Null Hypothesis: Different movie ratings all have the same revenue (the revenue is not significantly different among movie ratings).
- Alternate Hypothesis: Different movie ratings have different revenues (the revenue is significantly different among movie ratings).
- Significance Level (Alpha): Alpha value is 0.05.

### Select the correct test according to the data type and number of samples

In [ ]:
display(df_hypothesis1['certification'].dtype)
display(df_hypothesis1['revenue'].dtype)

In [ ]:
display(df_hypothesis1['certification'].info())
display(df_hypothesis1['revenue'].info())

In [ ]:
- Because the target data are numeric and there are 5 groups, the test will be an ANOVA and/or Tukey.

### Test the assumptions of the selected test.

#### Test for outliers

In [ ]:
# check for outliers
for i, data in groups.items():
    zscores = stats.zscore(data)
    outliers = abs(zscores) > 3
    print(np.sum(outliers))

In [ ]:
# remove outliers
for i, data in groups.items():
    data = data[(np.abs(stats.zscore(data)) < 3)]

#### Test for normality

In [ ]:
norm_results = {}
for i, data in groups.items():
    stat, p = stats.normaltest(data)
    ## save the p val, test statistic, and the size of the group
    norm_results[i] = {'n': len(data),
                       'p':p,
                       'test stat':stat}
## convert to a dataframe
norm_results_df = pd.DataFrame(norm_results).T
norm_results_df

In [ ]:
# check the significance with pandas 
norm_results_df['sig'] = norm_results_df['p'] < .05 
norm_results_df

In [ ]:
- The p-value is < 0.05 for all 4 groups, so there is a statistical difference between the distributions and a normal distribution.
- However, the group size (n) is > 15 for each of the groups, so the normality assumption can be safely ignored.

#### Test for equal variance

In [ ]:
stats.levene(*groups.values())

In [ ]:
- The p-value is < 0.05, so there is a statistical difference between the variances of the 2 samples.
- The non-parametric equivalent of the ANOVA is Kruskal-Wallis.

### Statistical testing

In [ ]:
result = stats.kruskal(*groups.values())
result

### Is there a significant difference between ratings?

In [ ]:
- The p-value is < 0.05, so reject the null hypothesis.
- The revenue is significantly different among movie ratings.

### If so, what was the p-value of the analysis?

In [ ]:
- The p-value is

### Which rating earns the most revenue?

#### Tukey's Pairwise Multiple Comparisons Test

In [ ]:
values = df_hypothesis1['revenue']
labels = df_hypothesis1['certification']

In [ ]:
tukeys_results = pairwise_tukeyhsd(values,labels)
tukeys_results.summary()

- In conclusion, ...
our test showed that there is a significant difference in the results of diet 3 compared to the other two diets. The amount of kilograms lost was significantly higher for those who were on diet 3.

### Supportive Visualization

In [ ]:
sns.barplot(data=df_hypothesis1, x='certification', y='revenue', palette = 'mako')
plt.title('The Revenue of Movies for Each Certification Rating', fontsize = 16, fontweight = 'bold');

## Does the genre of a movie affect how much revenue the movie generates?

In [ ]:
### Separate the data into groups

In [ ]:
# create a database with the target columns
query = """
select tmdb.revenue, tg.genre_id
from tmdb_data as tmdb
join title_genres as tg
on tmdb.imdb_id = tg.tconst;
"""
x = pd.read_sql(query, engine)
df_hypothesis2 = pd.DataFrame(x, columns = ['revenue', 'genre_id'])
df_hypothesis2.head()

In [ ]:
# separate the groups
groups = {}
for i in df_hypothesis2['genre_id'].unique():
    data = df_hypothesis2.loc[df_hypothesis2['genre_id']==i,'revenue'].copy()
    groups[i] = data
groups.keys()

### State the Null Hypothesis and Alternative Hypothesis
- Null Hypothesis: Different movie genres all have the same revenue (the revenue is not significantly different among movie genres).
- Alternate Hypothesis: Different movie genres have different revenues (the revenue is significantly different among movie genres).
- Significance Level (Alpha): Alpha value is 0.05.

### Select the correct test according to the data type and number of samples

In [ ]:
display(df_hypothesis2['genre_id'].dtype)
display(df_hypothesis2['revenue'].dtype)

In [ ]:
display(df_hypothesis2['genre_id'].info())
display(df_hypothesis2['revenue'].info())

In [ ]:
- Because the target data are numeric and there are 26 groups, the test will be an ANOVA and/or Tukey.

### Test the assumptions of the selected test.

#### Test for outliers

In [ ]:
# check for outliers
for i, data in groups.items():
    zscores = stats.zscore(data)
    outliers = abs(zscores) > 3
    print(np.sum(outliers))

In [ ]:
# remove outliers
for i, data in groups.items():
    data = data[(np.abs(stats.zscore(data)) < 3)]

#### Test for normality

In [ ]:
norm_results = {}
for i, data in groups.items():
    stat, p = stats.normaltest(data)
    ## save the p val, test statistic, and the size of the group
    norm_results[i] = {'n': len(data),
                       'p':p,
                       'test stat':stat}
## convert to a dataframe
norm_results_df = pd.DataFrame(norm_results).T
norm_results_df

In [ ]:
# check the significance with pandas 
norm_results_df['sig'] = norm_results_df['p'] < .05 
norm_results_df

In [ ]:
- The p-value is < 0.05 for all 26 groups, so there is a statistical difference between the distributions and a normal distribution.
- However, the group size (n) is > 15 for each of the groups, so the normality assumption can be safely ignored.

### Statistical testing

### Is there a significant difference between genres?

### If so, what was the p-value of the analysis?

### Which genre earns the most revenue?

### Supportive Visualization

## Does the budget of a movie affect how much revenue the movie generates?

### Statistical testing

### Is there a significant difference between budgets?

### If so, what was the p-value of the analysis?

### Which budget earns the most revenue?

### Supportive Visualization